/*
SQLyog Ultimate v12.09 (64 bit)
MySQL - 5.7.13-log : Database - benkesheng
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`benkesheng` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `benkesheng`;

/*Table structure for table `kebiao` */

DROP TABLE IF EXISTS `kebiao`;

CREATE TABLE `kebiao` (
  `id` int(64) unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `weeklytimes` varchar(255) DEFAULT NULL COMMENT '星期节次',
  `monday` varchar(255) DEFAULT 'NULL' COMMENT '星期一',
  `tuesday` varchar(255) DEFAULT 'NULL' COMMENT '星期二',
  `wednesday` varchar(255) DEFAULT 'NULL' COMMENT '星期三',
  `thursday` varchar(255) DEFAULT 'NULL' COMMENT '星期四',
  `friday` varchar(255) DEFAULT 'NULL' COMMENT '星期五',
  `saturday` varchar(255) DEFAULT 'NULL' COMMENT '星期六',
  `sunday` varchar(255) DEFAULT 'NULL' COMMENT '星期日',
  `user_id` varchar(64) DEFAULT 'NULL' COMMENT '课表外键',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `kebiao` */

insert  into `kebiao`(`id`,`weeklytimes`,`monday`,`tuesday`,`wednesday`,`thursday`,`friday`,`saturday`,`sunday`,`user_id`) values (1,'第1节(08:30-09:15)','','光传输与光纤技术_01(南校区信远教学楼I区信远I-405)','就业指导_05(南校区信远教学楼I区信远I-405)','光传输与光纤技术_01(南校区信远教学楼I区信远I-405)','光纤通信系统与光网络_01(南校区信远教学楼I区信远I-405)','','','NULL'),(2,'第2节(09:20-10:05)','','光传输与光纤技术_01(南校区信远教学楼I区信远I-405)','就业指导_05(南校区信远教学楼I区信远I-405)','光传输与光纤技术_01(南校区信远教学楼I区信远I-405)','光纤通信系统与光网络_01(南校区信远教学楼I区信远I-405)','','','NULL'),(3,'第3节(10:25-11:10)','就业指导_05(南校区信远教学楼I区信远I-405)','','','','光电子技术_01(南校区信远教学楼I区信远I-405)','','','NULL'),(4,'第4节(11:15-12:00)','就业指导_05(南校区信远教学楼I区信远I-405)','','','','光电子技术_01(南校区信远教学楼I区信远I-405)','','','NULL'),(5,'第5节(14:00-14:45)','激光原理与技术_01(南校区信远教学楼I区信远I-405)','光电子技术_01(南校区信远教学楼I区信远I-405)','光纤通信系统与光网络_01(南校区信远教学楼I区信远I-405)','激光原理与技术_01(南校区信远教学楼I区信远I-405)','','','','NULL'),(6,'第6节(14:50-15:35)','激光原理与技术_01(南校区信远教学楼I区信远I-405)','光电子技术_01(南校区信远教学楼I区信远I-405)','光纤通信系统与光网络_01(南校区信远教学楼I区信远I-405)','激光原理与技术_01(南校区信远教学楼I区信远I-405)','','','','NULL'),(7,'第7节(15:55-16:40)','','生物光子学_01(南校区信远教学楼I区信远I-405)','','形势与政策（Ⅵ）_06(南校区信远教学楼I区信远I-405)','生物光子学_01(南校区信远教学楼I区信远I-405)','','','NULL'),(8,'第8节(16:45-17:30)','','生物光子学_01(南校区信远教学楼I区信远I-405)','','形势与政策（Ⅵ）_06(南校区信远教学楼I区信远I-405)','生物光子学_01(南校区信远教学楼I区信远I-405)','','','NULL'),(9,'第9节(19:00-19:45)','','','','','','','','NULL'),(10,'第10节(19:50-20:35)','','','','','','','','NULL');

/*Table structure for table `score` */

DROP TABLE IF EXISTS `score`;

CREATE TABLE `score` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '主键',
  `course_id` varchar(255) DEFAULT 'NULL' COMMENT '课程号',
  `course_sq` varchar(255) DEFAULT 'NULL' COMMENT '课序号',
  `course_name` varchar(255) DEFAULT 'NULL' COMMENT '课程名',
  `en_name` varchar(255) DEFAULT 'NULL' COMMENT '课程英文名',
  `credit` int(16) DEFAULT NULL COMMENT '学分',
  `course_prop` varchar(255) DEFAULT 'NULL' COMMENT '课程属性',
  `score` varchar(64) DEFAULT 'NULL' COMMENT '成绩',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;

/*Data for the table `score` */

insert  into `score`(`id`,`course_id`,`course_sq`,`course_name`,`en_name`,`credit`,`course_prop`,`score`) values (1,'AM1001','40','军事理论','',2,'必修','88.0'),(2,'AM1002','40','军事训练','',1,'必修','通过'),(3,'FL1001','34','大学英语（Ⅰ）','',4,'必修','89.0'),(4,'HA1001','23','思想道德修养与法律基础','Morals&Ethics;&Fundamental; of Law',3,'必修','90.0'),(5,'HA1005','32','大学生职业发展','',1,'必修','85.0'),(6,'HA1008-1','32','形势与政策（Ⅰ）','',0,'必修','95.0'),(7,'HE1001','32','大学体育（Ⅰ）','',1,'必修','89.0'),(8,'ME1001','02','工程图学与计算机绘图','',3,'必修','70.0'),(9,'MS1001','32','高等数学A（Ⅰ）','',6,'必修','87.0'),(10,'PY1001','32','大学物理（Ⅰ）','',3,'必修','96.0'),(11,'PY2000-1','02','专业教育（Ⅰ）','',0,'必修','通过'),(12,'PY2001','01','新生研讨课','',1,'必修','通过'),(13,'PY3030','02','计算机导论与C语言程序设计','',3,'必修','87.0'),(14,'FL1002','34','大学英语（Ⅱ）','',4,'必修','82.0'),(15,'HA1002','25','马克思主义基本原理','Theory of Marxism',3,'必修','83.0'),(16,'HA1006','34','大学生心理健康教育','',1,'必修','优秀'),(17,'HA1008-2','13','形势与政策（Ⅱ）','',0,'必修','80.0'),(18,'HE1002','39','大学体育（Ⅱ）','',1,'必修','90.0'),(19,'MS1002','39','高等数学A（Ⅱ）','',6,'必修','95.0'),(20,'MS1007-05','05','线性代数','',3,'必修','92.0'),(21,'PY1002','37','大学物理（Ⅱ）','',5,'必修','97.0'),(22,'PY1003','44','物理实验（Ⅰ）','',1,'必修','中等'),(23,'PY5061','02','软件技术基础','',2,'学院选修','优秀'),(24,'TC1001','5','金工实习','',2,'必修','良好'),(25,'FL1003','51','大学英语（Ⅲ）','',4,'必修','83.0'),(26,'FL1005','01','国家英语四级','',1,'必修','通过'),(27,'HA1003','38','中国近现代史纲要','Outline of Modern Chinese History',2,'必修','84.0'),(28,'HA1008-3','12','形势与政策（Ⅲ）','',0,'必修','通过'),(29,'HA8053','01','影视鉴赏','',2,'人文限选','85.0'),(30,'HE1003','44','大学体育（Ⅲ）','',1,'必修','85.0'),(31,'IB1002-16','10','电路分析基础','',4,'必修','98.0'),(32,'IB1013','03','电路、信号与系统实验（Ⅰ）','',1,'必修','80.0'),(33,'ME7001','01','平面设计','',2,'公共任选','86.0'),(34,'MS1008-05','02','概率论与数理统计','',3,'必修','97.0'),(35,'MS1009-05','02','场论与复变函数','',3,'必修','96.0'),(36,'PY1004','32','物理实验（Ⅱ）','',1,'必修','中等'),(37,'PY2000-2','02','专业教育（Ⅱ）','',0,'必修','通过'),(38,'PY3001','03','热力学与统计物理学','',3,'必修','77.0'),(39,'PY5064','01','微机信息管理与多媒体技术','',2,'学院选修','中等'),(40,'PY5100','01','数值分析','',2,'学院选修','93.0'),(41,'FL1004','58','大学英语（Ⅳ）','',4,'必修','82.0'),(42,'HA1004','38','毛泽东思想和中国特色社会主义理论体系概论','',6,'必修','90.0'),(43,'HA1008-4','12','形势与政策（Ⅳ）','',0,'必修','良好'),(44,'HA8013','02','美学','',2,'人文限选','82.0'),(45,'HE1004','04','大学体育（Ⅳ）','',1,'必修','98.0'),(46,'IB1003-16','32','信号与系统','',4,'必修','83.0'),(47,'IB1005-05','02','模拟电子技术基础','',4,'必修','90.0'),(48,'IB1006-05','02','数字电路与逻辑设计','',3,'必修','76.0'),(49,'IB1014','10','电路、信号与系统实验（Ⅱ）','',1,'必修','85.0'),(50,'MI7003','01','专用集成电路设计','',2,'公共任选','80.0'),(51,'PY3000','02','量子力学','',3,'必修','79.0'),(52,'PY3002','02','数学物理方程','',3,'必修','95.0'),(53,'PY3090','02','电子线路实验（Ⅰ）','',1,'必修','通过'),(54,'FL1008','997','国家英语六级','',2,'公共任选','486.0'),(55,'HA1008-505','04','形势与政策（Ⅴ）','',0,'必修','90.0'),(56,'HA8054','01','美术鉴赏','',1,'人文限选','81.0'),(57,'IB1012-05','02','电磁场与电磁波','',3,'必修','92.0'),(58,'PY2000-3','07','专业教育（Ⅲ）','',0,'必修','通过'),(59,'PY3003','02','固体物理','',3,'必修','88.0'),(60,'PY3004','02','科技英语','',1,'必修','93.0'),(61,'PY3005-','01','专业基础实验','',2,'必修','通过'),(62,'PY3007','02','半导体物理','',3,'学院选修','85.0'),(63,'PY3008','02','物理光学（Ⅰ）','',4,'学院选修','85.0'),(64,'PY3009','02','应用光学（Ⅰ）','',3,'学院选修','89.0'),(65,'PY3091','02','电子线路实验（Ⅱ）','',1,'必修','优秀'),(66,'PY5000','01','半导体光电子器件','',2,'学院选修','86.0'),(67,'PY5062','03','微机原理与系统设计','',4,'学院选修','80.0'),(68,'PY5065','01','DSP技术','',2,'学院选修','78.0'),(69,'PY6001','01','遥感图像分析','Remote Sensing Image Analysis',2,'学院选修','65.0'),(70,'TC1002','10','电装实习','',1,'必修','85.0');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
